package 数组;

public class _198_打家劫舍 {
    public static void main(String[] args){
        _198_打家劫舍 sol = new _198_打家劫舍();
        int[] nums = {2, 1, 1, 2};
        System.out.println(sol.rob(nums));
    }
    /**
     * 你是一个专业的小偷，计划偷窃沿街的房屋。每间房内都藏有一定的现金，影响你偷窃的唯一制约因素就是相邻的房屋装有相互连通的防盗系统，如果两间相邻的房屋在同一晚上被小偷闯入，系统会自动报警。
     *
     * 给定一个代表每个房屋存放金额的非负整数数组，计算你 不触动警报装置的情况下 ，一夜之内能够偷窃到的最高金额。
     *
     * 想法💡：
     * @param nums
     * @return
     */
    public int rob(int[] nums){
        int cur = 0, pre = 0, tmp;
        //tmp就是一个中间变量
        for(int num : nums){
            tmp = cur;
            cur = Math.max(pre + num, cur);
            pre = tmp;
        }
        return cur;
    }
}
